
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Bootloader_title" = "Bootloader";
"Bootloader_description" = "Clover EFI necessita de três arquivos essênciais. (em termos simples)
boot0 (No MBR do disco) responsável por carregar o boot1.
boot1 (No setor de boot da partição) para encontrar o boot2.
boot2 (Na raiz da partição) para carregar /EFI/BOOT/CLOVERIA32.efi ou CLOVERX64.efi, kernel, etc.";

"boot0_title" = "BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Usado para inicialização em placas mãe padrão BIOS.
Usa fdisk440 para instalar boot0 nos primeiros 440 bits do MBR sem destruir nenhuma instalação do Windows caso tenha uma, então boot0 buscará na primeira partição HFS ativa por boot1h2, ou buscará na primeira partição Fat32 ativa por boot1f32alt.
Esta opção irá definir a partição HFS ou FAT32 selecionada como ativa.
É necessário formatar como Fat32 no Windows ou Mac da seguinte maneira.
  1. Primeiro apagar (formatar) como MS-DOS (FAT) com o Utilitário de Disco.
  2. (pelo terminal) diskutil list
  3. (pelo terminal) diskutil unmount /dev/rdiskXsY (X disco Y partição)
  4. (pelo terminal) newfs_msdos -v Fat32 -F 32 /dev/rdiskXsY (X disco Y partição)
  5. (pelo terminal) diskutil mount /dev/rdiskXsY (X disco Y partição)";

"boot0hfs_title" = "BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Usado para inicialização em placas mãe padrão BIOS.
Usa fdisk440 para instalar boot0hfs nos primeiros 440 bits do MBR sem destruir nenhuma instalação do Windows caso tenha uma, então boot0hfs buscará na primeira partição HFS ativa por boot1h2, ou buscará na primeira partição Fat32 ativa por boot1f32alt.
Esta opção não irá definir uma partição HFS selecionada como ativa, mas irá definir uma Fat32 como ativa.
É necessário formatar como Fat32 no Windows ou Mac da seguinte maneira.
  1. Primeiro apagar (formatar) como MS-DOS (FAT) com o Utilitário de Disco.
  2. (pelo terminal) diskutil list
  3. (pelo terminal) diskutil unmount /dev/rdiskXsY (X disco Y partição)
  4. (pelo terminal) newfs_msdos -v Fat32 -F 32 /dev/rdiskXsY (X disco Y partição)
  5. (pelo terminal) diskutil mount /dev/rdiskXsY (X disco Y partição)";

"boot0EFI_title" = "BIOS GPT EFI (HFS+Fat32)";
"boot0EFI_description" = "Usado para inicialização em placas mãe padrão BIOS.
Usa fdisk440 para instalar boot0hfs nos primeiros 440 bits do MBR sem destruir nenhuma instalação do Windows caso tenha uma, então boot0hfs buscará na primeira partição GPT HFS ativa por boot1h2 ou boot1f32alt.
Esta opção não irá definir a partição selecionada como ativa
É necessário formatar a partição EFI como HFS no Mac pelo terminal com os seguintes comandos (X disco Y partição).
  diskutil list
  newfs_hfs -v EFI /dev/rdiskXsY 
Ou formatar a partição EFI como Fat32 no Mac pelo terminal com os seguintes comandos (X disco Y partição).
  diskutil list
  newfs_msdos -v EFI -F 32 /dev/rdiskXsY";

"bootNo_title" = "Somente Extrair";
"bootNo_description" = "Usado para inicialização em placas mãe padrão BIOS.
Não irá instalar nenhum dos arquivos: boot0 , boot0hfs, boot0md, boot1h2 e boot1f32alt, usado para instalação manual em discos com setores de 4kb.";

"bootUEFI_title" = "Inicialização UEFI (Placas Mãe UEFI)";
"bootUEFI_description" = "Usado para inicialização em placas mãe padrão UEFI.
Não irá instalar nenhum dos arquivos: boot0 , boot0hfs, boot0md, boot1h2 e boot1f32alt.
É necessário configurar sua BIOS para inicialização UEFI:
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "Instalar e Definir o boot padrão em 32bit";
"boot32_description" = "Instala os arquivos de boot e define o início em 32bit.
Inicialização padrão = Clover EFI 32bit. Você poderá..
Apertar a tecla 1 para boot1 = Iniciar o Chameleon,
Apertar a tecla 3 para boot3 = Iniciar o Clover EFI em 32bit,
Apertar a tecla 6 para boot6 = Iniciar o Clover EFI em 64bit.";

"boot64_title" = "Instalar e Definir o boot padrão em 64bit";
"boot64_description" = "Instala os arquivos de boot e define o início em 64bit.
Inicialização padrão = Clover EFI 64bit. Você poderá..
Apertar a tecla 1 para boot1 = Iniciar o Chameleon,
Apertar a tecla 3 para boot3 = Iniciar o Clover EFI em 32bit,
Apertar a tecla 6 para boot6 = Iniciar o Clover EFI em 64bit.";

// ============================================================================
// CloverEFI
// ----------------------------------------------------------------------------
"CloverEFI_title" = "CloverEFI";
"CloverEFI_description" = "Select the version of CloverEFI to install.";
"cloverEFI.32_title" = "CloverEFI 32-bits";
"cloverEFI.32_description" = "CloverEFI 32-bits";
"cloverEFI.64.sata_title" = "CloverEFI 64-bits SATA";
"cloverEFI.64.sata_description" = "CloverEFI 64-bits using SATA to access drives";
"cloverEFI.64.blockio_title" = "CloverEFI 64-bits BiosBlockIO";
"cloverEFI.64.blockio_description" = "CloverEFI 64-bits using Bios Block I/O to access drives";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Temas";
"Themes_description" = "Selecione Temas para instalação.";

"black_green_title" = "black_green";
"black_green_description" = "Tema padrão black_green by Blackosx,
Será instalado em /EFI/BOOT/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme by Eps,
Será instalado em /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme by mrengles,
Será instalado em /EFI/BOOT/themes/mrengles.";

"iBootloader_title" = "iClover";
"iBootloader_description" = "Grey style theme by winlog,
Será instalado em /EFI/BOOT/themes/iClover.";

"buttons_title" = "buttons";
"buttons_description" = "Tema Buttons by Trauma,
Será instalado em /EFI/BOOT/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Tema Hellfire by illevelll,
Será instalado em /EFI/BOOT/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "O tema metal original by Slice,
Será instalado em /EFI/BOOT/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Tema Simple_gray by hijeane,
Será instalado em /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Tema Wooden by iROOTa,
Será instalado em /EFI/BOOT/themes/wooden.";

// ============================================================================
// RC Scripts
// ----------------------------------------------------------------------------
"rc.scripts.on.target_title" = "Install RC scripts on target volume";
"rc.scripts.on.target_description" = "Install all RC scripts on target volume.
The target volume must be a bootable OSX system volume.";
"rc.scripts.on.all.volumes_title" = "Install all RC scripts on all bootable OSX volumes";
"rc.scripts.on.all.volumes_description" = "Install all RC scripts on all internal bootable OSX volumes.";
"Optional RC Scripts" = "Optional RC Scripts";
"disable_sleep_proxy_client_description" = "Disable the mDNSResponder sleep proxy client service. This will prevent the system waking from sleep every hours";

// ----------------------------------------------------------------------------